Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS60/edc/PIC32CM5164LS60048.PIC
<?xml version="1.0" encoding="UTF-8" standalone="no"?><edc:PIC xmlns:edc="http://crownking/edc" xmlns:atdf="http://crownking/atdf" xmlns:ltx="http://crownking/ltx" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" atdf:architecture="CORTEX-M23" atdf:family="PIC32CM" edc:arch="arm32bit" edc:hasFreeze="false" edc:masksetid="SG003" edc:name="PIC32CM5164LS60048" edc:procid="0x0000" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Properties>
    <edc:Property edc:propkey="file.registers.are.odd.address.accessible" edc:propvalue="true"/>
  </edc:Properties>
  <edc:Power>
    <edc:VDD edc:maxvoltage="3.63" edc:minvoltage="2.0" edc:nominalvoltage="3.300"/>
  </edc:Power>
  <edc:Programming edc:haslvp2="true"/>
  <edc:ArchDef edc:desc="arm32bit" edc:name="arm32bit">
    <edc:MemTraits edc:addrinc="0x1" edc:locsize="0x1" edc:wordimpl="0xFFFFFFFF" edc:wordinit="0xFFFFFFFF" edc:wordsafe="0xFFFFFFFF" edc:wordsize="0x4"/>
  </edc:ArchDef>
  <edc:InstructionSet edc:instructionsetid="armv8m"/>
  <edc:InterruptList>
    <edc:Interrupt edc:cname="Reset" edc:desc="Reset Vector, invoked on Power up and warm reset" edc:irq="-15"/>
    <edc:Interrupt edc:cname="NonMaskableInt" edc:desc="Non maskable Interrupt, cannot be stopped or preempted" edc:irq="-14"/>
    <edc:Interrupt edc:cname="HardFault" edc:desc="Hard Fault, all classes of Fault" edc:irq="-13"/>
    <edc:Interrupt edc:cname="SVCall" edc:desc="System Service Call via SVC instruction" edc:irq="-5"/>
    <edc:Interrupt edc:cname="PendSV" edc:desc="Pendable request for system service" edc:irq="-2"/>
    <edc:Interrupt edc:cname="SysTick" edc:desc="System Tick Timer" edc:irq="-1"/>
    <edc:Interrupt edc:cname="SYSTEM" edc:desc="System peripherals shared interrupt" edc:irq="0" ltx:memberofperipheral="MCLK OSCCTRL OSC32KCTRL PM SUPC"/>
    <edc:Interrupt edc:cname="WDT" edc:desc="Watchdog Timer" edc:irq="1" ltx:memberofperipheral="WDT"/>
    <edc:Interrupt edc:cname="RTC" edc:desc="Real Time Counter" edc:irq="2" ltx:memberofperipheral="RTC"/>
    <edc:Interrupt edc:cname="EIC_EXTINT_0" edc:desc="External Channel 0" edc:irq="3" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:cname="EIC_EXTINT_1" edc:desc="External Channel 1" edc:irq="4" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:cname="EIC_EXTINT_2" edc:desc="External Channel 2" edc:irq="5" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:cname="EIC_EXTINT_3" edc:desc="External Channel 3" edc:irq="6" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:cname="EIC_EXTINT_4" edc:desc="External Channel 4" edc:irq="7" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:cname="EIC_EXTINT_5" edc:desc="External Channel 5" edc:irq="8" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:cname="EIC_EXTINT_6" edc:desc="External Channel 6" edc:irq="9" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:cname="EIC_EXTINT_7" edc:desc="External Channel 7" edc:irq="10" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:cname="EIC_OTHER" edc:desc="External Channel 8..X" edc:irq="11" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:cname="FREQM" edc:desc="Frequency Meter" edc:irq="12" ltx:memberofperipheral="FREQM"/>
    <edc:Interrupt edc:cname="NVMCTRL" edc:desc="Non-Volatile Memory Controller" edc:irq="13" ltx:memberofperipheral="NVMCTRL"/>
    <edc:Interrupt edc:cname="PORT" edc:desc="Port Non-Secure Check" edc:irq="14" ltx:memberofperipheral="PORT"/>
    <edc:Interrupt edc:cname="DMAC_0" edc:desc="DMA Channel 0" edc:irq="15" ltx:memberofperipheral="DMAC"/>
    <edc:Interrupt edc:cname="DMAC_1" edc:desc="DMA Channel 1" edc:irq="16" ltx:memberofperipheral="DMAC"/>
    <edc:Interrupt edc:cname="DMAC_2" edc:desc="DMA Channel 2" edc:irq="17" ltx:memberofperipheral="DMAC"/>
    <edc:Interrupt edc:cname="DMAC_3" edc:desc="DMA Channel 3" edc:irq="18" ltx:memberofperipheral="DMAC"/>
    <edc:Interrupt edc:cname="DMAC_OTHER" edc:desc="DMA Channel 4..X" edc:irq="19" ltx:memberofperipheral="DMAC"/>
    <edc:Interrupt edc:cname="USB" edc:desc="Universal Serial Bus" edc:irq="20" ltx:memberofperipheral="USB"/>
    <edc:Interrupt edc:cname="EVSYS_0" edc:desc="Event System Channel 0" edc:irq="21" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:cname="EVSYS_1" edc:desc="Event System Channel 1" edc:irq="22" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:cname="EVSYS_2" edc:desc="Event System Channel 2" edc:irq="23" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:cname="EVSYS_3" edc:desc="Event System Channel 3" edc:irq="24" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:cname="EVSYS_4" edc:desc="Event System Channel 4" edc:irq="25" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:cname="EVSYS_5" edc:desc="Event System Channel 5" edc:irq="26" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:cname="EVSYS_6" edc:desc="Event System Channel 6" edc:irq="27" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:cname="EVSYS_7" edc:desc="Event System Channel 7" edc:irq="28" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:cname="EVSYS_NSCHK" edc:desc="Event System Non-Secure Check" edc:irq="29" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:cname="PAC" edc:desc="Peripheral Access Controller" edc:irq="30" ltx:memberofperipheral="PAC"/>
    <edc:Interrupt edc:cname="SERCOM0_0" edc:desc="Serial Communication Interface 0" edc:irq="31" ltx:memberofperipheral="SERCOM0"/>
    <edc:Interrupt edc:cname="SERCOM0_1" edc:desc="Serial Communication Interface 0" edc:irq="32" ltx:memberofperipheral="SERCOM0"/>
    <edc:Interrupt edc:cname="SERCOM0_2" edc:desc="Serial Communication Interface 0" edc:irq="33" ltx:memberofperipheral="SERCOM0"/>
    <edc:Interrupt edc:cname="SERCOM0_OTHER" edc:desc="Serial Communication Interface 0" edc:irq="34" ltx:memberofperipheral="SERCOM0"/>
    <edc:Interrupt edc:cname="SERCOM1_0" edc:desc="Serial Communication Interface 1" edc:irq="35" ltx:memberofperipheral="SERCOM1"/>
    <edc:Interrupt edc:cname="SERCOM1_1" edc:desc="Serial Communication Interface 1" edc:irq="36" ltx:memberofperipheral="SERCOM1"/>
    <edc:Interrupt edc:cname="SERCOM1_2" edc:desc="Serial Communication Interface 1" edc:irq="37" ltx:memberofperipheral="SERCOM1"/>
    <edc:Interrupt edc:cname="SERCOM1_OTHER" edc:desc="Serial Communication Interface 1" edc:irq="38" ltx:memberofperipheral="SERCOM1"/>
    <edc:Interrupt edc:cname="SERCOM2_0" edc:desc="Serial Communication Interface 2" edc:irq="39" ltx:memberofperipheral="SERCOM2"/>
    <edc:Interrupt edc:cname="SERCOM2_1" edc:desc="Serial Communication Interface 2" edc:irq="40" ltx:memberofperipheral="SERCOM2"/>
    <edc:Interrupt edc:cname="SERCOM2_2" edc:desc="Serial Communication Interface 2" edc:irq="41" ltx:memberofperipheral="SERCOM2"/>
    <edc:Interrupt edc:cname="SERCOM2_OTHER" edc:desc="Serial Communication Interface 2" edc:irq="42" ltx:memberofperipheral="SERCOM2"/>
    <edc:Interrupt edc:cname="SERCOM3_0" edc:desc="Serial Communication Interface 3" edc:irq="43" ltx:memberofperipheral="SERCOM3"/>
    <edc:Interrupt edc:cname="SERCOM3_1" edc:desc="Serial Communication Interface 3" edc:irq="44" ltx:memberofperipheral="SERCOM3"/>
    <edc:Interrupt edc:cname="SERCOM3_2" edc:desc="Serial Communication Interface 3" edc:irq="45" ltx:memberofperipheral="SERCOM3"/>
    <edc:Interrupt edc:cname="SERCOM3_OTHER" edc:desc="Serial Communication Interface 3" edc:irq="46" ltx:memberofperipheral="SERCOM3"/>
    <edc:Interrupt edc:cname="SERCOM4_0" edc:desc="Serial Communication Interface 4" edc:irq="47" ltx:memberofperipheral="SERCOM4"/>
    <edc:Interrupt edc:cname="SERCOM4_1" edc:desc="Serial Communication Interface 4" edc:irq="48" ltx:memberofperipheral="SERCOM4"/>
    <edc:Interrupt edc:cname="SERCOM4_2" edc:desc="Serial Communication Interface 4" edc:irq="49" ltx:memberofperipheral="SERCOM4"/>
    <edc:Interrupt edc:cname="SERCOM4_OTHER" edc:desc="Serial Communication Interface 4" edc:irq="50" ltx:memberofperipheral="SERCOM4"/>
    <edc:Interrupt edc:cname="SERCOM5_0" edc:desc="Serial Communication Interface 5" edc:irq="51" ltx:memberofperipheral="SERCOM5"/>
    <edc:Interrupt edc:cname="SERCOM5_1" edc:desc="Serial Communication Interface 5" edc:irq="52" ltx:memberofperipheral="SERCOM5"/>
    <edc:Interrupt edc:cname="SERCOM5_2" edc:desc="Serial Communication Interface 5" edc:irq="53" ltx:memberofperipheral="SERCOM5"/>
    <edc:Interrupt edc:cname="SERCOM5_OTHER" edc:desc="Serial Communication Interface 5" edc:irq="54" ltx:memberofperipheral="SERCOM5"/>
    <edc:Interrupt edc:cname="TC0" edc:desc="Timer Counter 0" edc:irq="55" ltx:memberofperipheral="TC0"/>
    <edc:Interrupt edc:cname="TC1" edc:desc="Timer Counter 1" edc:irq="56" ltx:memberofperipheral="TC1"/>
    <edc:Interrupt edc:cname="TC2" edc:desc="Timer Counter 2" edc:irq="57" ltx:memberofperipheral="TC2"/>
    <edc:Interrupt edc:cname="TCC0" edc:desc="TCC Match/Compare 0" edc:irq="58" ltx:memberofperipheral="TCC0"/>
    <edc:Interrupt edc:cname="TCC1" edc:desc="TCC Match/Compare 1" edc:irq="59" ltx:memberofperipheral="TCC1"/>
    <edc:Interrupt edc:cname="TCC2" edc:desc="TCC Match/Compare 2" edc:irq="60" ltx:memberofperipheral="TCC2"/>
    <edc:Interrupt edc:cname="TCC3" edc:desc="TCC Match/Compare 3" edc:irq="61" ltx:memberofperipheral="TCC3"/>
    <edc:Interrupt edc:cname="ADC_OTHER" edc:desc="Analog To Digital Converter" edc:irq="62" ltx:memberofperipheral="ADC"/>
    <edc:Interrupt edc:cname="ADC_RESRDY" edc:desc="ADC Result Ready" edc:irq="63" ltx:memberofperipheral="ADC"/>
    <edc:Interrupt edc:cname="AC" edc:desc="Analog Comparator" edc:irq="64" ltx:memberofperipheral="AC"/>
    <edc:Interrupt edc:cname="DAC_UNDERRUN" edc:desc="Digital to Analog Converter" edc:irq="65" ltx:memberofperipheral="DAC"/>
    <edc:Interrupt edc:cname="DAC_EMPTY" edc:desc="DAC Buffer 0 Empty" edc:irq="66" ltx:memberofperipheral="DAC"/>
    <edc:Interrupt edc:cname="PTC" edc:desc="Peripheral Touch Controller" edc:irq="67" ltx:memberofperipheral="PTC"/>
    <edc:Interrupt edc:cname="TRNG" edc:desc="True Random Generator" edc:irq="68" ltx:memberofperipheral="TRNG"/>
    <edc:Interrupt edc:cname="I2S" edc:desc="Inter-IC Sound Interface" edc:irq="69" ltx:memberofperipheral="I2S"/>
    <edc:Interrupt edc:cname="TRAM" edc:desc="Trust Ram" edc:irq="70" ltx:memberofperipheral="TRAM"/>
  </edc:InterruptList>
  <edc:PeripheralList>
    <edc:Peripheral edc:cname="AC" edc:desc=""/>
    <edc:Peripheral edc:cname="ADC" edc:desc=""/>
    <edc:Peripheral edc:cname="CCL" edc:desc=""/>
    <edc:Peripheral edc:cname="CoreDebug" edc:desc=""/>
    <edc:Peripheral edc:cname="CoreDebug_NS" edc:desc=""/>
    <edc:Peripheral edc:cname="DAC" edc:desc=""/>
    <edc:Peripheral edc:cname="DIB" edc:desc=""/>
    <edc:Peripheral edc:cname="DIB_NS" edc:desc=""/>
    <edc:Peripheral edc:cname="DMAC" edc:desc=""/>
    <edc:Peripheral edc:cname="DSU" edc:desc=""/>
    <edc:Peripheral edc:cname="DWT" edc:desc=""/>
    <edc:Peripheral edc:cname="EIC" edc:desc=""/>
    <edc:Peripheral edc:cname="EVSYS" edc:desc=""/>
    <edc:Peripheral edc:cname="FPB" edc:desc=""/>
    <edc:Peripheral edc:cname="FREQM" edc:desc=""/>
    <edc:Peripheral edc:cname="GCLK" edc:desc=""/>
    <edc:Peripheral edc:cname="I2S" edc:desc=""/>
    <edc:Peripheral edc:cname="ICB" edc:desc=""/>
    <edc:Peripheral edc:cname="ICB_NS" edc:desc=""/>
    <edc:Peripheral edc:cname="IDAU" edc:desc=""/>
    <edc:Peripheral edc:cname="MCLK" edc:desc=""/>
    <edc:Peripheral edc:cname="MPU" edc:desc=""/>
    <edc:Peripheral edc:cname="MPU_NS" edc:desc=""/>
    <edc:Peripheral edc:cname="NVIC" edc:desc=""/>
    <edc:Peripheral edc:cname="NVIC_NS" edc:desc=""/>
    <edc:Peripheral edc:cname="NVMCTRL" edc:desc=""/>
    <edc:Peripheral edc:cname="FUSES" edc:desc=""/>
    <edc:Peripheral edc:cname="OPAMP" edc:desc=""/>
    <edc:Peripheral edc:cname="OSC32KCTRL" edc:desc=""/>
    <edc:Peripheral edc:cname="OSCCTRL" edc:desc=""/>
    <edc:Peripheral edc:cname="PAC" edc:desc=""/>
    <edc:Peripheral edc:cname="PM" edc:desc=""/>
    <edc:Peripheral edc:cname="PORT" edc:desc=""/>
    <edc:Peripheral edc:cname="PTC" edc:desc=""/>
    <edc:Peripheral edc:cname="RSTC" edc:desc=""/>
    <edc:Peripheral edc:cname="RTC" edc:desc=""/>
    <edc:Peripheral edc:cname="SCB" edc:desc=""/>
    <edc:Peripheral edc:cname="SCB_NS" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM0" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM1" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM2" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM3" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM4" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM5" edc:desc=""/>
    <edc:Peripheral edc:cname="SUPC" edc:desc=""/>
    <edc:Peripheral edc:cname="SysTick" edc:desc=""/>
    <edc:Peripheral edc:cname="SysTick_NS" edc:desc=""/>
    <edc:Peripheral edc:cname="TC0" edc:desc=""/>
    <edc:Peripheral edc:cname="TC1" edc:desc=""/>
    <edc:Peripheral edc:cname="TC2" edc:desc=""/>
    <edc:Peripheral edc:cname="TCC0" edc:desc=""/>
    <edc:Peripheral edc:cname="TCC1" edc:desc=""/>
    <edc:Peripheral edc:cname="TCC2" edc:desc=""/>
    <edc:Peripheral edc:cname="TCC3" edc:desc=""/>
    <edc:Peripheral edc:cname="TRAM" edc:desc=""/>
    <edc:Peripheral edc:cname="TRNG" edc:desc=""/>
    <edc:Peripheral edc:cname="USB" edc:desc=""/>
    <edc:Peripheral edc:cname="WDT" edc:desc=""/>
  </edc:PeripheralList>
  <edc:PhysicalSpace>
    <edc:NMMRPlace edc:regionid="corenmmrs">
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R0" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="0" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R1" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="4" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R2" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="8" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R3" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="12" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R4" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="16" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R5" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="20" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R6" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="24" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R7" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="28" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R8" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="32" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R9" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="36" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R10" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="40" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R11" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="44" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R12" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="48" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SP" edc:desc="Stack Pointer" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="52" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MSP_S" edc:desc="Main Stack Pointer Secure" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="112" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MSP_NS" edc:desc="Main Stack Pointer Non-secure" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="104" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PSP_S" edc:desc="Process Stack Pointer Secure" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="116" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PSP_NS" edc:desc="Process Stack Pointer Non-secure" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="108" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MSP" edc:desc="Main Stack Pointer" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="64" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PSP" edc:desc="Process Stack Pointer" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="68" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="LR" edc:desc="Link Register" edc:impl="0xFFFFFFFF" edc:mclr="11111111111111111111111111111111" edc:nmmrid="56" edc:nzwidth="0x20" edc:por="11111111111111111111111111111111"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PC" edc:desc="Program Counter" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="60" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnn---n---------------nnnnnnnnn" edc:cname="PSR" edc:desc="Program Status Register" edc:impl="0xF10001FF" edc:mclr="00000001000000000000000000000000" edc:nmmrid="72" edc:nzwidth="0x20" edc:por="00000001000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnn----------------------------" edc:cname="APSR" edc:desc="Application Program Status Register" edc:impl="0xF0000000" edc:mclr="00000000000000000000000000000000" edc:nmmrid="76" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="--------------------------rrrrrr" edc:cname="IPSR" edc:desc="Interrupt Program Status Register" edc:impl="0x3F" edc:mclr="00000000000000000000000000000000" edc:nmmrid="80" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="-------r------------------------" edc:cname="EPSR" edc:desc="Execution Program Status Register" edc:impl="0x1000000" edc:mclr="00000001000000000000000000000000" edc:nmmrid="84" edc:nzwidth="0x20" edc:por="00000001000000000000000000000000"/>
      <edc:SFRDef edc:access="-------------------------------n" edc:cname="PRIMASK_S" edc:desc="Priority Mask Register Secure" edc:impl="0x1" edc:mclr="00000000000000000000000000000000" edc:nmmrid="508" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="-------------------------------n" edc:cname="PRIMASK_NS" edc:desc="Priority Mask Register Non-secure" edc:impl="0x1" edc:mclr="00000000000000000000000000000000" edc:nmmrid="524" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="-------------------------------n" edc:cname="PRIMASK" edc:desc="Priority Mask Register" edc:impl="0x1" edc:mclr="00000000000000000000000000000000" edc:nmmrid="88" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="------------------------------nn" edc:cname="CONTROL_S" edc:desc="Control Register Secure" edc:impl="0x3" edc:mclr="00000000000000000000000000000000" edc:nmmrid="520" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="------------------------------nn" edc:cname="CONTROL_NS" edc:desc="Control Register Non-secure" edc:impl="0x3" edc:mclr="00000000000000000000000000000000" edc:nmmrid="536" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="------------------------------nn" edc:cname="CONTROL" edc:desc="Control Register" edc:impl="0x3" edc:mclr="00000000000000000000000000000000" edc:nmmrid="100" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnn---" edc:cname="PSPLIM_S" edc:desc="Process Stack Limit Pointer Register Secure" edc:impl="0xFFFFFFF8" edc:mclr="00000000000000000000000000000000" edc:nmmrid="132" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnn---" edc:cname="MSPLIM_S" edc:desc="Main Stack Limit Pointer Register Secure" edc:impl="0xFFFFFFF8" edc:mclr="00000000000000000000000000000000" edc:nmmrid="128" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
    </edc:NMMRPlace>
    <edc:CodeSector atdf:pagesize="0x40" edc:beginaddr="0x0" edc:endaddr="0x80000" edc:regionid="IFLASH" edc:rw="rw"/>
    <edc:CodeSector atdf:pagesize="0x40" edc:beginaddr="0x400000" edc:endaddr="0x404000" edc:regionid="DATAFLASH" edc:rw="rw"/>
    <edc:UserZone atdf:pagesize="0x40" edc:beginaddr="0x804000" edc:endaddr="0x804100" edc:erasepagesize="0x100" edc:regionid="USER_PAGE" edc:rw="rw"/>
    <edc:ConfigFuseSector atdf:pagesize="0x40" edc:beginaddr="0x804000" edc:endaddr="0x804024" edc:erasepagesize="0x100" edc:regionid="USER_FUSES">
      <edc:DCRDef edc:_addr="0x804000" edc:access="nnnnnnn---------nnnnnnnnn-nnnnnn" edc:cname="USER_WORD_0" edc:default="0xB08F4377" edc:factorydefault="0xB08F4377" edc:impl="0xFE00FFBF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="FUSES">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="NVMCTRL_SULCK" edc:desc="NVM Secure Region Locks" edc:nzwidth="0x3"/>
            <edc:DCRFieldDef edc:cname="NVMCTRL_NSULCK" edc:desc="NVM Non-Secure Region Locks" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="BOD33USERLEVEL" edc:desc="BOD33 User Level" edc:nzwidth="0x6"/>
            <edc:DCRFieldDef edc:cname="BOD33_DIS" edc:desc="BOD33 Disable" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
