Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS60/edc/PIC32CM5164LS60048.PIC
      <edc:SFRDef edc:_addr="0x40001008" edc:access="---nnnnn----nnnn-----nnn---n--nn" edc:cname="INTENSET" edc:impl="0x1F0F0713" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="XOSCRDY" edc:desc="XOSC Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XOSCFAIL" edc:desc="XOSC Clock Failure Detector Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OSC16MRDY" edc:desc="OSC16M Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DFLLULPRDY" edc:desc="DFLLULP Ready interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLULPLOCK" edc:desc="DFLLULP Lock Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLULPNOLOCK" edc:desc="DFLLULP No Lock Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKR" edc:desc="DPLL Lock Rise Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKF" edc:desc="DPLL Lock Fall Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLLTO" edc:desc="DPLL Lock Timeout Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLLDRTO" edc:desc="DPLL Loop Divider Ratio Update Complete Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DFLLRDY" edc:desc="DFLL Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLOOB" edc:desc="DFLL Out Of Bounds Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKF" edc:desc="DFLL Lock Fine Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKC" edc:desc="DFLL Lock Coarse Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLRCS" edc:desc="DFLL Reference Clock Stopped Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000100C" edc:access="---nnnnn----nnnn-----nnn---n--nn" edc:cname="INTFLAG" edc:impl="0x1F0F0713" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="XOSCRDY" edc:desc="XOSC Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XOSCFAIL" edc:desc="XOSC Clock Failure Detector" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OSC16MRDY" edc:desc="OSC16M Ready" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DFLLULPRDY" edc:desc="DFLLULP Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLULPLOCK" edc:desc="DFLLULP Lock" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLULPNOLOCK" edc:desc="DFLLULP No Lock" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKR" edc:desc="DPLL Lock Rise" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKF" edc:desc="DPLL Lock Fall" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLLTO" edc:desc="DPLL Lock Timeout" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLLDRTO" edc:desc="DPLL Loop Divider Ratio Update Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DFLLRDY" edc:desc="DFLL Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLOOB" edc:desc="DFLL Out Of Bounds Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKF" edc:desc="DFLL Lock Fine Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKC" edc:desc="DFLL Lock Coarse Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLRCS" edc:desc="DFLL Reference Clock Stopped Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001010" edc:access="---rrrrr----rrrr-----rrr---r-rrr" edc:cname="STATUS" edc:impl="0x1F0F0717" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="XOSCRDY" edc:desc="XOSC Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XOSCFAIL" edc:desc="XOSC Clock Failure Detector" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XOSCCKSW" edc:desc="XOSC Clock Switch" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="OSC16MRDY" edc:desc="OSC16M Ready" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DFLLULPRDY" edc:desc="DFLLULP Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLULPLOCK" edc:desc="DFLLULP Lock" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLULPNOLOCK" edc:desc="DFLLULP No Lock" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKR" edc:desc="DPLL Lock Rise" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKF" edc:desc="DPLL Lock Fall" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLLTO" edc:desc="DPLL Lock Timeout" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLLDRTO" edc:desc="DPLL Loop Divider Ratio Update Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DFLLRDY" edc:desc="DFLL Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLOOB" edc:desc="DFLL Out Of Bounds" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKF" edc:desc="DFLL Lock Fine" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKC" edc:desc="DFLL Lock Coarse" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLRCS" edc:desc="DFLL Reference Clock Stopped" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001014" edc:access="nnnnnnnnnn-nnnn-" edc:cname="XOSCCTRL" edc:impl="0xFFDE" edc:mclr="0000000010000000" edc:nzwidth="0x10" edc:por="0000000010000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Oscillator Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XTALEN" edc:desc="Crystal Oscillator Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFDEN" edc:desc="Clock Failure Detector Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWBEN" edc:desc="Clock Switch Back Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="On Demand Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GAIN" edc:desc="Oscillator Gain" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="GAIN2" edc:desc="2MHz max" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="GAIN4" edc:desc="4MHz max" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="GAIN8" edc:desc="8MHz max" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="GAIN16" edc:desc="16MHz max" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="GAIN30" edc:desc="30MHz max" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AMPGC" edc:desc="Automatic Amplitude Gain Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STARTUP" edc:desc="Start-Up Time" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="CYCLE1" edc:desc="1 cycle" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE2" edc:desc="2 cycles" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE4" edc:desc="4 cycles" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE8" edc:desc="8 cycles" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE16" edc:desc="16 cycles" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE32" edc:desc="32 cycles" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE64" edc:desc="64 cycles" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE128" edc:desc="128 cycles" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE256" edc:desc="256 cycles" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE512" edc:desc="512 cycles" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE1024" edc:desc="1024 cycles" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE2048" edc:desc="2048 cycles" edc:when="(field &amp; 0xF) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE4096" edc:desc="4096 cycles" edc:when="(field &amp; 0xF) == 0xC"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE8192" edc:desc="8192 cycles" edc:when="(field &amp; 0xF) == 0xD"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE16384" edc:desc="16384 cycles" edc:when="(field &amp; 0xF) == 0xE"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE32768" edc:desc="32768 cycles" edc:when="(field &amp; 0xF) == 0xF"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001016" edc:access="-----nnn" edc:cname="CFDPRESC" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="CFDPRESC" edc:desc="Clock Failure Detector Prescaler" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="OSC16M/1" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="OSC16M/2" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="OSC16M/4" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="OSC16M/8" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="OSC16M/16" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="OSC16M/32" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="OSC16M/64" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="OSC16M/128" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40001017" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x40001018" edc:access="nn--nnn-" edc:cname="OSC16MCTRL" edc:impl="0xCE" edc:mclr="10000010" edc:nzwidth="0x8" edc:por="10000010" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Oscillator Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL" edc:desc="Oscillator Frequency Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="4MHZ" edc:desc="4MHz" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="8MHZ" edc:desc="8MHz" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="12MHZ" edc:desc="12MHz" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="16MHZ" edc:desc="16MHz" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="On Demand Control" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40001019" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x4000101C" edc:access="-----nnnnnnnn-n-" edc:cname="DFLLULPCTRL" edc:impl="0x7FA" edc:mclr="0000010100000100" edc:nzwidth="0x10" edc:por="0000010100000100" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BINSE" edc:desc="Binary Search Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SAFE" edc:desc="Tuner Safe Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DITHER" edc:desc="Tuner Dither Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="On Demand" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIV" edc:desc="Division Factor" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Frequency Divided by 1" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Frequency Divided by 2" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Frequency Divided by 4" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Frequency Divided by 8" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Frequency Divided by 16" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="Frequency Divided by 32" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000101E" edc:access="-nnn-nnn" edc:cname="DFLLULPDITHER" edc:impl="0x77" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="STEP" edc:desc="Dither Step" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="STEP1" edc:desc="Dither Step = 1" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="STEP2" edc:desc="Dither Step = 2" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="STEP4" edc:desc="Dither Step = 4" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="STEP8" edc:desc="Dither Step = 8" edc:when="(field &amp; 0x7) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PER" edc:desc="Dither Period" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="PER1" edc:desc="Dither Over 1 Reference Clock Period" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="PER2" edc:desc="Dither Over 2 Reference Clock Period" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PER4" edc:desc="Dither Over 4 Reference Clock Period" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="PER8" edc:desc="Dither Over 8 Reference Clock Period" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="PER16" edc:desc="Dither Over 16 Reference Clock Period" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="PER32" edc:desc="Dither Over 32 Reference Clock Period" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000101F" edc:access="n-------" edc:cname="DFLLULPRREQ" edc:impl="0x80" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="RREQ" edc:desc="Read Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
