Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS60/edc/PIC32CM5164LS60048.PIC
      <edc:SFRDef edc:_addr="0x40001020" edc:access="------------------------nnnnnnnn" edc:cname="DFLLULPDLY" edc:impl="0xFF" edc:mclr="00000000000000000000000010000000" edc:nzwidth="0x20" edc:por="00000000000000000000000010000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="DELAY" edc:desc="Delay Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001024" edc:access="---------------------nnnnnnnnnnn" edc:cname="DFLLULPRATIO" edc:impl="0x7FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="RATIO" edc:desc="Target Tuner Ratio" edc:nzwidth="0xB"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001028" edc:access="----------------------------r-r-" edc:cname="DFLLULPSYNCBUSY" edc:impl="0xA" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable Bit Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DELAY" edc:desc="Delay Register Synchronization Busy" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4000102C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x40001030" edc:access="----nnnnnnnnnnn-" edc:cname="DFLLCTRL" edc:impl="0xFFE" edc:mclr="0000000010000000" edc:nzwidth="0x10" edc:por="0000000010000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="DFLL Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="Operating Mode Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STABLE" edc:desc="Stable DFLL Frequency" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LLAW" edc:desc="Lose Lock After Wake" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USBCRM" edc:desc="USB Clock Recovery Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="On Demand Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCDIS" edc:desc="Chill Cycle Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QLDIS" edc:desc="Quick Lock Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BPLCKC" edc:desc="Bypass Coarse Lock" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAITLOCK" edc:desc="Wait Lock" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40001032" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x40001034" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DFLLVAL" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="FINE" edc:desc="Fine Value" edc:nzwidth="0xA"/>
            <edc:SFRFieldDef edc:cname="COARSE" edc:desc="Coarse Value" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="DIFF" edc:desc="Multiplication Ratio Difference" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001038" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DFLLMUL" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="MUL" edc:desc="DFLL Multiply Factor" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="FSTEP" edc:desc="Fine Maximum Step" edc:nzwidth="0xA"/>
            <edc:SFRFieldDef edc:cname="CSTEP" edc:desc="Coarse Maximum Step" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000103C" edc:access="n-------" edc:cname="DFLLSYNC" edc:impl="0x80" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="READREQ" edc:desc="Read Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4000103D" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x40001040" edc:access="nn----n-" edc:cname="DPLLCTRLA" edc:impl="0xC2" edc:mclr="10000000" edc:nzwidth="0x8" edc:por="10000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="DPLL Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="On Demand Clock Activation" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
