Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS60/edc/PIC32CM5164LS60048.PIC
      <edc:SFRDef edc:_addr="0x42003810" edc:access="nnnnnnnnnnnnnnnn" edc:cname="WINUT" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="WINUT" edc:desc="Window Upper Threshold" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003812" edc:access="----nnnnnnnnnnnn" edc:cname="GAINCORR" edc:impl="0xFFF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="GAINCORR" edc:desc="Gain Correction Value" edc:nzwidth="0xC"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003814" edc:access="----nnnnnnnnnnnn" edc:cname="OFFSETCORR" edc:impl="0xFFF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="OFFSETCORR" edc:desc="Offset Correction Value" edc:nzwidth="0xC"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42003816" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x42003818" edc:access="------nn" edc:cname="SWTRIG" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="FLUSH" edc:desc="ADC Flush" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="START" edc:desc="Start ADC Conversion" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42003819" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x4200381C" edc:access="-------n" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:desc="Debug Run" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4200381D" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x42003820" edc:access="-----rrrrrrrrrrr" edc:cname="SYNCBUSY" edc:impl="0x7FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="SWRST Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="ENABLE Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INPUTCTRL" edc:desc="INPUTCTRL Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTRLC" edc:desc="CTRLC Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AVGCTRL" edc:desc="AVGCTRL Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SAMPCTRL" edc:desc="SAMPCTRL Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WINLT" edc:desc="WINLT Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WINUT" edc:desc="WINUT Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GAINCORR" edc:desc="GAINCORR Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OFFSETCORR" edc:desc="OFFSETCTRL Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG" edc:desc="SWTRG Synchronization Busy" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42003822" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x42003824" edc:access="rrrrrrrrrrrrrrrr" edc:cname="RESULT" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="RESULT" edc:desc="Result Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42003826" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x42003828" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SEQCTRL" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="SEQEN" edc:desc="Enable Positive Input in the Sequence" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200382C" edc:access="-----nnn-----nnn" edc:cname="CALIB" edc:impl="0x707" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="BIASCOMP" edc:desc="Bias Comparator Scaling" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="BIASREFBUF" edc:desc="Bias Reference Buffer Scaling" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4200382E" edc:offset="0x3D2"/>
      <edc:SFRDef edc:_addr="0x42003C00" edc:access="------nn" edc:cname="CTRLA" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable DAC Controller" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C01" edc:access="-----nnn" edc:cname="CTRLB" edc:impl="0x7" edc:mclr="00000010" edc:nzwidth="0x8" edc:por="00000010" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="DIFF" edc:desc="Differential mode enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REFSEL" edc:desc="Reference Selection for DAC0/1" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="VREFAU" edc:desc="Unbuffered External Voltage Reference (not buffered in DAC, direct connection)" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VDDANA" edc:desc="Analog Voltage Supply" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="VREFAB" edc:desc="Buffered External Voltage Reference (buffered in DAC)" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="INTREF" edc:desc="Internal Voltage Reference" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C02" edc:access="--nnnnnn" edc:cname="EVCTRL" edc:impl="0x3F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="STARTEI0" edc:desc="Start Conversion Event Input DAC 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STARTEI1" edc:desc="Start Conversion Event Input DAC 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EMPTYEO0" edc:desc="Data Buffer Empty Event Output DAC 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EMPTYEO1" edc:desc="Data Buffer Empty Event Output DAC 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVEI0" edc:desc="Enable Invertion of DAC 0 input event" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVEI1" edc:desc="Enable Invertion of DAC 1 input event" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42003C03" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x42003C04" edc:access="----nnnn" edc:cname="INTENCLR" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="UNDERRUN0" edc:desc="Underrun Interrupt Enable for DAC 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERRUN1" edc:desc="Underrun Interrupt Enable for DAC 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EMPTY0" edc:desc="Data Buffer 0 Empty Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EMPTY1" edc:desc="Data Buffer 1 Empty Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C05" edc:access="----nnnn" edc:cname="INTENSET" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="UNDERRUN0" edc:desc="Underrun Interrupt Enable for DAC 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERRUN1" edc:desc="Underrun Interrupt Enable for DAC 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EMPTY0" edc:desc="Data Buffer 0 Empty Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EMPTY1" edc:desc="Data Buffer 1 Empty Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C06" edc:access="----nnnn" edc:cname="INTFLAG" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="UNDERRUN0" edc:desc="DAC 0 Underrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERRUN1" edc:desc="DAC 1 Underrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EMPTY0" edc:desc="Data Buffer 0 Empty" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EMPTY1" edc:desc="Data Buffer 1 Empty" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C07" edc:access="----rrrr" edc:cname="STATUS" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="READY0" edc:desc="DAC 0 Startup Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="READY1" edc:desc="DAC 1 Startup Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC0" edc:desc="DAC 0 End of Conversion" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:desc="DAC 1 End of Conversion" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C08" edc:access="--------------------------rrrrrr" edc:cname="SYNCBUSY" edc:impl="0x3F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="DAC Enable Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATA0" edc:desc="Data DAC 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATA1" edc:desc="Data DAC 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATABUF0" edc:desc="Data Buffer DAC 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATABUF1" edc:desc="Data Buffer DAC 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C0C" edc:access="----nnnnnn--nnnn" edc:cname="DACCTRL0" edc:impl="0xFCF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="LEFTADJ" edc:desc="Left Adjusted Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable DAC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCTRL" edc:desc="Current Control" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="CC100K" edc:desc="GCLK_DAC &lt;= 1.2MHz (100kSPS)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CC1M" edc:desc="1.2MHz &lt; GCLK_DAC &lt;= 6MHz (500kSPS)" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CC12M" edc:desc="6MHz &lt; GCLK_DAC &lt;= 12MHz (1MSPS)" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DITHER" edc:desc="Dithering Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REFRESH" edc:desc="Refresh period" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="REFRESH_0" edc:desc="Do not Refresh" edc:when="(field &amp; 0xF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_2" edc:desc="Refresh every 60US" edc:when="(field &amp; 0xF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_3" edc:desc="Refresh every 90US" edc:when="(field &amp; 0xF) == 3"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_4" edc:desc="Refresh every 120US" edc:when="(field &amp; 0xF) == 4"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_5" edc:desc="Refresh every 150US" edc:when="(field &amp; 0xF) == 5"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_6" edc:desc="Refresh every 180US" edc:when="(field &amp; 0xF) == 6"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_7" edc:desc="Refresh every 210US" edc:when="(field &amp; 0xF) == 7"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_8" edc:desc="Refresh every 240US" edc:when="(field &amp; 0xF) == 8"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_9" edc:desc="Refresh every 270US" edc:when="(field &amp; 0xF) == 9"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_10" edc:desc="Refresh every 300US" edc:when="(field &amp; 0xF) == 10"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_11" edc:desc="Refresh every 330US" edc:when="(field &amp; 0xF) == 11"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_12" edc:desc="Refresh every 360US" edc:when="(field &amp; 0xF) == 12"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_13" edc:desc="Refresh every 390US" edc:when="(field &amp; 0xF) == 13"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_14" edc:desc="Refresh every 420US" edc:when="(field &amp; 0xF) == 14"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_15" edc:desc="Refresh every 450US" edc:when="(field &amp; 0xF) == 15"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C0E" edc:access="----nnnnnn--nnnn" edc:cname="DACCTRL1" edc:impl="0xFCF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="LEFTADJ" edc:desc="Left Adjusted Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable DAC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCTRL" edc:desc="Current Control" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="CC100K" edc:desc="GCLK_DAC &lt;= 1.2MHz (100kSPS)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CC1M" edc:desc="1.2MHz &lt; GCLK_DAC &lt;= 6MHz (500kSPS)" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CC12M" edc:desc="6MHz &lt; GCLK_DAC &lt;= 12MHz (1MSPS)" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DITHER" edc:desc="Dithering Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REFRESH" edc:desc="Refresh period" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="REFRESH_0" edc:desc="Do not Refresh" edc:when="(field &amp; 0xF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_2" edc:desc="Refresh every 60US" edc:when="(field &amp; 0xF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_3" edc:desc="Refresh every 90US" edc:when="(field &amp; 0xF) == 3"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_4" edc:desc="Refresh every 120US" edc:when="(field &amp; 0xF) == 4"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_5" edc:desc="Refresh every 150US" edc:when="(field &amp; 0xF) == 5"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_6" edc:desc="Refresh every 180US" edc:when="(field &amp; 0xF) == 6"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_7" edc:desc="Refresh every 210US" edc:when="(field &amp; 0xF) == 7"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_8" edc:desc="Refresh every 240US" edc:when="(field &amp; 0xF) == 8"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_9" edc:desc="Refresh every 270US" edc:when="(field &amp; 0xF) == 9"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_10" edc:desc="Refresh every 300US" edc:when="(field &amp; 0xF) == 10"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_11" edc:desc="Refresh every 330US" edc:when="(field &amp; 0xF) == 11"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_12" edc:desc="Refresh every 360US" edc:when="(field &amp; 0xF) == 12"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_13" edc:desc="Refresh every 390US" edc:when="(field &amp; 0xF) == 13"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_14" edc:desc="Refresh every 420US" edc:when="(field &amp; 0xF) == 14"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_15" edc:desc="Refresh every 450US" edc:when="(field &amp; 0xF) == 15"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C10" edc:access="wwwwwwwwwwwwwwww" edc:cname="DATA0" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="DAC0 Data" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C12" edc:access="wwwwwwwwwwwwwwww" edc:cname="DATA1" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="DAC0 Data" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C14" edc:access="wwwwwwwwwwwwwwww" edc:cname="DATABUF0" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="DATABUF" edc:desc="DAC0 Data Buffer" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
